disOrder/app/controllers/api/servers_controller.rb

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def show
      @server = Server.find(params[:id])

INSERT INTO "servers" ("owner_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["owner_id", 1], ["name", "Boosqua"], ["created_at", "2020-10-13 18:45:17.168245"], ["updated_at", "2020-10-13 18:45:17.168245"]]
---
   def create
      @server = Server.new(server_params)
      @server.owner_id = params[:user_id]
      if @server.save

SELECT "servers".* FROM "servers"
---
   def index
      @servers = Server.all

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "servers" SET "name" = $1, "updated_at" = $2 WHERE "servers"."id" = $3  [["name", "alkjshdklas"], ["updated_at", "2020-10-13 19:55:43.819096"], ["id", 1]]
---
   def update
      @server = Server.find(params[:id])
      if false # || current_user == nil || server.owner_id != current_user.id
         render json: ['You do not have access to update this server'], status: 404
      elsif @server.update(server_params)

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "servers" WHERE "servers"."id" = $1  [["id", 1]]
---
   def destroy
      @server = Server.find(params[:id])
      if false # || current_user == nil || server.owner_id != current_user.id
         render json: ['You do not have access to update this server'], status: 404
      elsif @server.destroy